{"2025-03-19": "Traded a bit of news in crude. nothing was good though. the meat of the day was j pow. been messing with support and resistance on a rolling 30 minute window with volume. seems to be good for entries and even exits. For starters, i got a fade of fomc. went to a volume profile level and pulled back. retest also went to the same level. then went to baseline \"which i missed\". that was the nuts of the day. could have held that shit until powell presser was over. but here is where things got interesting. soft berg was in there today and puked his fucking guts out. massive soft berg near the highs. market was lighting him up. i got in some, but was too chicken shit to hold. it felt like everyone and their mother was selling. it broke and then maybe a minute or two later, powell was gonna finish talking. another one came in, and i got short after that one. then the market just tanked. one of the best post powell fades i've seen. i really got chopped up in all that action though. i got the 250 fade because it went to another level, but the 3pm fade is insane. i thought i might have seen something wth 70 lots on tns, but it wasn't super clear. i definitely am rusty but there were some good trades i messed up and one i missed (pow baseline test). it was exciting to see trades, but i need a better way to find them", "2025-03-20": "Really kept it light. i think when things go to the meaty part of a bell curve on volume, it's good for a fade on quick moves. seems to be pretty good. got the 250 sweep decently. then the4 255 sweep, i pre worked at a level, went right through it and i wasn't that close. very unlucky, but i was working pre and got punished. don't do that. it would have been great to see that happen then fade. at 5930, i think there was something selling. wasn't drip, but it was definitively red. got a small winner but it wasn't great. i would have won today if it were for that 255 randomness", "2025-03-21": "traded quad witching that was good. i got a nice equity open fade. went right to a level and bounced off. keep looking at that. in es close, there were a couple trades. first, i missed a nasdaq 1k whitebar. it was at about 12 pm. later,  it looked like a group of orders near the top of a zone. traded through pretty quick. i stayed away from 250 sweeep and 255 sweep, didn't look like good enough setups. best trade was 600 lot selling every 5-10 at 5930 onwards. white knuckled it for the 3pm fade and held through because that shit never fades. then after the close at like 30030ish, i noticed it was right at a nice little volume profile and not going down. i got long and that was the play. volume profile saved your ass. o at 53ish i thought i saw a bid stacker. i think there was one in there, but then the 600 came in and i got short", "2025-03-24": "Got chopped around in news a bit. i don't think you can trust a big move as a correct move. 3pm fade went right to a level for the fade. that was sick. worked pretty instantly. got long post 3 just in case there was a crash, but it held. did hold til close, but was onsides at end", "2025-03-25": "didn't win a single trade today. news wasn't great. 250 fade looked pretty good and it ended up working, but it stopped me out. best trade was 127 buying every 3 at 5929 onwards. adjusting filters to see next time. fade didn't work. i did hold for 2 minutes and it looked like it might have worked. maybe it's just a gamble", "2025-03-26": "Didn't see much today. news flow wasn't great. 250 255 just chop. best trade was in nq 900 lot came in. great white bar. es 1k lots not so good. is it berg bro?", "2025-03-27": "I got murdered today in news. Mexico seemed pretty tough on tariffs, but the market just launched up. the one time i seemed to be onsides, the chinese came out and were bullish on cooperation. fuck me. 250 fade did not work. just total death. didn't see anything easy on tns. the lesson of the day was if there is no paper, there is no trade. I can't afford to over trade", "2025-03-31": "Might have seen 500 sweep at 1:13:22:609 in es and 1:13:29.871 in nq. 534 in es and 385 in nq\n\nI think it happened again at 1:42:25:298 in es and 1:42:28:265 in nq. 514 and 383 respectively. is aggregation correct?\n\nOne more time. 2:44:37:828 514 and 2:43:54:796 in nq and it was a 385. also maybe something with 200's and 100/s that follow?\n\n59 had 225 selling every 3. fucking nuts. couldn't hold through 3, but massive move post 3.", "2025-04-01": "Offer stacker of 250 every 10 or so starting at 55. very choppy and didn't really end up working. looks like some buyers cam in at 59. i see a seller drip though? idk", "2025-04-02": "Fairly slow day until 3pm. market popped up on trump annoucement, then went to like a 400 in nq. that was the tippy top. i did get short, but i didn't hold correctly. that was pretty much the one trade there was. I was long for the big crash down, even though i was working off market. also worked off market in front of an 800 lot on the bid and it just got mega swept through. i thought i was safe. i didn't lose too much, but i think it was a stop through instead of a bounce? gotta stay patient and wait for the big scalps. also be mindful of the direction. only enter trades around paper. i think that would have reduced the amount of trades you were in.\n\nTraded the 5's. missed the big ass move in es. that was the play. i tried to be in the micro, it looked like there was some sort of arb situation. the match price was above es, so it looked like a better trade, but right before the open, it slammed down. i may have been able to get it if i was in the mini instead. lessons everywhere...\n\n7's, i thought i was going to trade corn, but the match didn't look amazing. i was under the assumption that china would retaliate and not import soybeans which would bring the whole market down. however, i didn't end up trading. the volume didnt look great. i was correct. at least i saved some money there", "2025-04-03": "6's selling in silver and 12's in gold. silver definitely gave it away. idk if it was amazing, but i won\n\nDefinitely over traded again today. not only is it bad form, it hurts the amount you can put on at the close\ntanked again at 59. 31 ish a second at 59. held for 54 seconds. insantity post close\n\nif you must trade during the day, it's around large sizes. if it's below vwap, sell pops on large sizes or when large sizes come in. don't work in front of sizes.\n\nOverall, be mindful of the close. that's what is good. everything else is mostly crap. need sweeps and large sizes during the day, that's it\n\nselling pops and leaning on large sizes does two things. 1 it keeps you from trading. 2 it defines your risk. ", "2025-04-04": "800's in nq the only trade. tried to just scalp sizes, but wait for the good setups and massive pullbacks.\n\nwas green today, but was red like 600. vwap bouce on 30 minute was wild. maybe call it vwap defender? could be worth a backtest", "2025-04-07": "Peaked at 1k ended at -250. i was over trading for sure. soft bergs sucked me in. i crushed during the super vol, but died on the trend at noon. there were some fantastic trades yesterday, like the bottom of es being the soft berg. the match was great. trump 90 day tariff pause news, then the reversal when it was fake. it was pretty tough passed 3pm. 59 had the sell off, but when it didn't rip, i kinda got out. then there was a drip buyer of about 30/s at 5930. then just chaos at the close for the fade. it ended up going up though. 800s and 1k's in es, but i didn't have my leverage back until later in the day. gotta refresh amp margin page. i got additional leverage as at noon then i lost every thing pretty quick. big sizes are for leans and settles", "2025-04-08": "some great trades in there and some stupid shit as well. i wasn't in a bunch for the soft bergs at the open, but they were rather big. 1200 volume each. the stop through was the play and hold all day. i wasn't in enough and didn't have enough leverage to do so. won't miss tomorrow. it looks like i sold the top, then misclicked out. didn't have the confidence to re sell. but that was the top of the day... i've been having ma/ema lines as support and resistance. looks like  i got a couple wicks. i think i need to be more selective though. there were soft bergs on a second wve on the 5 minute at 130. massive wicks randomly too. it felt like news, but it wasn't. that was a freebie. there was a 1k lot on the bid i leaned on at lows, that died, but i got stopped out. one also on the offer, i leaned, but it felt like news came out or something. also lost. i need to shy away from a lot of trades though. i was pre short at 250 assuming a big move down, but it did the opposite. i also was pre short at 59, but that yielded nothing. at 5930 there was a 200 lot bid stacker or so. shoulda smashed 20. i need to stick to the big obvious combos. wait for paper", "2025-04-09": "Extraordinarily frustrating day. i was up about 3k at one point, but i had 152 trades today....... WHY THE FUCK DID YOU HAVE 152 trades. bid stacker at the open seemed decent. saw it a couple of times during the day and it wasn't good. i think i got sucked into ma levels, which was tough. it looksl ike i had a trade every 3 minutes today. then news came out at 1219. sold initially because that was the market reaction. ok, i kept selling because i didn't know the exact news. i was trying to figure out why i couldn't trade mhg. then i bought. then i sold. i was flipping around too much. i got a lucky sell at 1222, maybe a lean? but at some point, i should have known it was a go with, especially on the 90 day tariff pause. i literally made like 2k and then chipped it all back in 5 minutes. got a nice sell at 1229. and then gave half back in 5 minutes. got another sell at 1239, up 2k on that then went on a massive run up to 3k. then i sized up to 10 lots. 20 trades in 16 minutes.  a vast majority of these trades are fades not go withs. sold a 20 lot in front of a 1.5k i think. that only lost 500, but i had given back 1500 before that donking around. by 119 i was back at 0. i got one good sell at highs at 135 made a grand back. let me guess proceeded to donk offyes, then i stopped at 145, up 400. made 400 in ub at settle. i give all of that back, and at 226, i'm up 400 once again. i see an offer stacker that is growing  at 254, using 20 lots. i'm chopping in and out, when i should be selling and holding. i'm in and out waaaaay too much. give everything back. so the lesson.  so, 3-4 good trades today. bid stacker at the open, worth seeing if it's there tomorrow. news at 1219, that was it. the one. buy and fucking hold. don't over trade. i don't even think i should have sold until settle. DON'T FADE NEWS. DON'T do bounces. wait for edge.", "2025-04-10": "There are some good trades in there, and i've reduced my trading, but i'm still in too much. Use the 30 minute macd as your bias and only enter trades in the direction of macd. That would elimnate all the buys, which would take away about half of the trades you did. however, 830 stacker thing or settles is the exception. selling pops was still extraordinarily difficult and risky. idk what to do about that one. auction at noon was good in terms of just insanity. popped up then sold off hard.\n\nHogs had 3/s selling. made a little, but i guess i gotta trade settles again\n\nOffer came in crude. was good. came in at 27. fade did work, but it wasn't too clean imo\n\nso high level thought. macd 30 minute is going to be my bias. what do i do around crosses? stay away?\n\nEs had a bid stacker at 58. it was also up a bunch at 50, so i thought the fuck you face ripper rally could continue. i puked it though. waited til 5830. saw a buyer of 68 every 3. but a seller of 250 every 3 started at 5831. basically scratched. my sell for the drip was a good hold though. held for 52 seconds. i still over traded. i just gotta stay away from 250 and 255, whatever the fuck is going on there. don't trade without news and only trade settles/opens/events?", "2025-04-11": "Day started out with a soft berg in es at the open for the morning fade. tested once, bounced, got in on the retest. really ripped. should be in more for those sbs. \n\nthere was another big on at highs i was in 15 for. didn't work but i didn't lose a lot.\n\n silver had a seller, made a couple ticks. fade didn't work, big up day.\n\n gold was looking for sellers at settle, saw something start at 28. it stopped, i got out. big bid stacker at settle. i got in. then got out looking to fade. fade didn't work then ripped up. 30 min macd said buy bias, i should have held the long. try that next time.\n\nhogs had something at settle. 4/s maybe. lost a tick\n\ncrude, no offer stacker today. saw what looked like might have been it, but it wasn't. was in 5 lost 2 ticks\n\nes offer stacker at 55, it was really fighting and cvd was up. i waited til it hovered to get short. the offer stacker was growing. that was a max 2x and it worked. kinda felt like something was coming in the other way though. i did a mini buy after because macd had a buy side bias for the fade. kinda worked, but didn't die\n\noverall very calm day. about 21 trades. settles are what is grounding and what can be studied. let the games begin", "2025-04-15": "lots of 58's selling in es at 59. got stopped out near the low, but it seemed like it was going to work. turned around at 5945. not much else today really. some trump news, but it was range bound and choppy", "2025-04-16": "Donked off about 400 in nq trying to get bracket orders ready. should have been in mnq for that. very stupid. didn't really have trades until powell. \n\nmarket swept down for his speech release and i never found a short on the chart. used 5 minute trend lines and wanted a pull back but never really got one until late in the trade. for the long, there was the weekly vwap that hadn't been tested since friday, it's wednesday, and i thought it would be good for abounce. it ended up taking the size, then weak breaking. so i was kinda right, but i was early, so i was wrong. \n\nthe really good trade i think was when there was a pullback, i was thinking \"wait for paper to either go with or take\" and there was a dragging 250 lot bid that was essentially right at the 9 ema. i doubled clicked but only got 1 fill? anyways, that was great. trailing stopped that to the low. \n\nthen, squawk came out that powell speech was ending. for the youtube link i had, he was still talking, but i know i didn't have the fastest link. i trusted and bought 4, fading the downtrend.puked about 10 seconds later on a pullback. i was just expecting it to work. and there was no paper. maybe i have to risk to lows in that scenario? it did end up working though, so maybe that was the lesson. it literally shook me out then went up. i think maybe i needed a position and then a double down.", "2025-04-21": "Saw a seller at 59. but its kinda hard to read with the current font. i got out because i was a bit late and it whipped back. i got back in at 5933 because i thought i saw some bigger sellers. i was greedy and didn't use the full stop thinking it was gonna go. but of course around 45 it turned back around and i took a loss. i think i just gotta full stop for simplicity.", "2025-04-29": "Ng bid stacker at 28. seemed pretty big. went down. also dragging offer in ng cal\n\nOffer stacker in es at 5930 and 5945. i puked when it wasn't super constant. didn't lose much which was nice\n", "2025-04-30": "Welp. kinda fucked today up. news in crude. saudi's don't care if oil price is down, market tanked. then a story about how china said trump reached out about a trade deal. i bought crude twice. didn't work. saudi story was bigger. gold didn't have much at settle, but there was more news, but it was mostly a miss click. there was no feedback or average price when i entered a trade... really stupid. went through and fixed a lot of workspaces after that happened. lost like 600 there. hogs july had 9 selling every 2. kinda worked, but had to take some heat. then there was es\n\nMoC big sweep up, then 5440 happened it was up, then i saw 5450 up and 55 was up. kinda fucked that up. didn't enter long until 57, which is when it tanked. (also EoM, probably gonna go down). saw 234's selling every 3 in es at 59. sold 20. that didn't work. took a loser, but it was a good spot. then saw a big dragging size at 5950, that worked. trailing stopped it. needed to be tighter i think, i missed out on a bit\n\nBut here is where i fucked up\n\nUB had some massive seller. at 59. wasn't clear, but definitely in there. cvd shows it clearly. although, es was a very clear drip. Baited\n", "2025-05-01": "Great trading today. There was crude news. trump said no oil from iran or you get tariffs. got in on a pullback. happened just before energy settle. there was an offer berg in july... that set the top\n\nK trade worked well. down at 50, down at 5440. got short at 5440 and held. got out at 57, but idk if i should have gotten entirely out. my squawks were going through my headphones. something happened in es between 300 and 301. like bunhc of bids coming in", "2025-05-02": "Did some stupid shit in non farm, lost\n\nsome news story came out about china doing some talking about a deal. was right about 9 o clock and i think the algos were off. i bought and took a winner\n\n250 sweep was up, then 2440 was down, i got short 1, it worked\n\nthen at 58, 231 every 3 started selling. went down through 59 then just whipped up. i got out luckily. \n\nthen something turned on at like 5945 on the offer, just looked crazy. i kinda faded but that shit was scary\n\nthen post 3, looks like sbs came on the bid. 4 sizes of 30-50. i got long, took a winner\n\noverall, best day in a long time. 3k", "2025-05-06": "5440 was down 55 was down. that worked for about a minute. did stupid shit in news too\n\n59 had massive offers dragging. stupid edgepro doesn't have more than 1 click. gotta change that. was execllent. fade was meh. i kept getting this fucking iceberg popup in bookmap. stupid", "2025-05-07": "Lots of trades today. got sucked into some news that wasn't good. i think i need a bunch of alerts going off for a successful go with. The big news was post powell with nvidia chip export curbs potentially rolling back. \n\nPre powell, there were 2 20 lot bergs on the offer at like 128. i got short on them in anticaption that market would tank when powell started it did, but it wasn't the top. chop from there\n\nThere was a 100 lot soft iceberg that ended up being the temporary top. k said it was good, but is 1 enough? idk if it was a smasher, but it worked\n\nthen there was the sb breakout. there was a hard berg that swept up on powell comments fairly close to the berg, then it was go time. there was only 1, so the breakout seemed pretty good. i kinda fucked it up though\n\npost powell fade was very quick. needed to be fast. CVD was up even though the market wasn't specatularly up from the rate annoucement at 1 and the end of the speech. it wasn't worth that much for me, but man did it go fast. it didn't go far, so it hink my assessment was correct. moreover, that wasn't the local high, so i think i made the right decision to be in small.\n\nWhat I have to remember is to stay away from strict no paper trades during powell.", "2025-05-14": "Fack. Settle had an early  offer stacker. didn't really  work................................  it was pretty big............ iidk\n\nbest stuff was pre settle. interesting clusters of orders then selling in TNS. 1500 lot in nq. sizes in nq thorughout the day...", "2025-05-15": "Interesting shit in es during the day. definitely a go with around highs/lows. be aware of it. did a lot of bug fixes, which was good. big MOC today 5 billion. big launch up at 50 but then it swept through the other way pre 55. kinda wild. 5950 was a massive up move. got the 5945 turn around and that just launched through 3. does that always happen? 59 was down. very fucking weird day.  230 had some weird shit. 188 bergs in TN doing like 1600 started pre 830 and went til like 1130. stuff going on in le during the morning. 100 lot sweeps and biids moving around. ZL LD", "2025-05-16": "Some sizes coming in le. 5 lots. bergs.  maybe back months are better? there was a point where they were in the front and the back. idk\n\nes had big uni mich inflation reading. like super high. or was it consumer confidence. either way, it was bad\ni got pretty short, but the trade was baseline. even that didn't work\n\nhogs nv had a seller at settle. kinda worked. had to be quick. \n\nES had a drip  at 59. 230 every 3 or so. didn't work. small moc\n", "2025-05-19": "moc was 1.6 to buy side. top 25% i would say. there was a sell execution that didn't work until it got big. market went up from 59- about 5950 then turned around. i would have gotten chopped up if i stayed it. not good. some news today. trump and putin talked then trump and zelensky talked. apparently it was good. crude sold off a bit\n\ni'm glad i didn't die today, but there were a lot of traps. keep coding and staying hands off... outlook negative...", "2025-05-20": "253 buying in es every 3 in last 30 seconds. maybe you got 5 ticks. nothing burger MOC. 250 fade?", "2025-05-27": "Happy Birthday to me. -500 bucks. got caught up in es. made a bit in gold post settle, but lost trading stops(go with rather than fade). got short at 59 due to stop thing and it kinda worked, but it didn't really. lost a tick. stacker on offer at 5945,but it went up. mim was a buy. just not much there today. apparently es 50's are good pre 830. gotta be on the lookout for those. nq 15's 30's as well", "2025-05-28": "tiny offer stacker came in at 50. very early. probably 30-50 in size every maybe 5 seconds. it really worked. i got murdered in gold today. gotta size down and figure out what the hell that thing is", "2025-05-29": "Fucked around in news and got popped. redbox is just too slow. if anything do baseline, but even then, expect a pop. nq 15's were there, really ripped. i did not hold long enough though. apparently, 25's at the open in es.  250 was awesome today, but i got greedy and held my last one. 59 also really worked. don't know on what though. also MiM seemed positive, so i put a buy stop at 5950, that got hit and it worked. need better trailing stops though. doing this manually sucks", "2025-05-30": "Got unlucky with 250 today. both sides got hit. really shitty. got sucked into gold, gotta size down before i figure that fcker out. didn't do as bad as the other day. ub wasn't super clean today, but cvd was good the last 30 seconds or so. missed some big bergs in ng, over 200's good leans maybe. missed this opening range trade. gotta be on it, it seems to be very good. don't miss nq 15's, those seem to be good. zn had something start at 158 slow then speed up 159. fade was bad. maybe got 2 ticks in zn on the sell.", "2025-06-02": "Missed the 15's in nq today. were good. came in on the bid, but had to be fast as fuck. lost on 250, but only worked offers to get in. would have lost a lot on the buy side. Manu PMI today. was in a 5 for the number. actually got inpre number on  a sweep down. so kinda lucky, but that was really really good. best trade of the day", "2025-06-04": "gold was fantastic last night. 20's selling 740ish. gotta be careful with the long though. not a lock. ng had some big berg leans the last two days. Unfortunately, i gave it all back in es. the trades just aren't low risk, i try too many times, and i have too much leverage in there. leaning on sb's in es, seems to be good, but the executions just don't seem to be there. maybe keep that shit to pre fomc", "2025-06-06": "ES today, 50s on offer. kinda fucked up, but didn't really work. gold last night bad, but made maybe a little back during the day? gotta be careful with the 1st print...\n\nhogs cal roll good. 10's selling aggressively. turned around at 40. ng leans good. even bad ones not terrible\n\nnq 5's post\n\nbest trade today was es OR. seems fantastic", "2025-06-10": "he cal had 27's going to market early. then 100 lot bid stacker at settle. i was short and got long. scratched the short and got a loser at settle.\n\nNG leans were good. need to be around for 7 am. \n\nNQ some stops went off at highs, then some hanging 300 lot bids. lean worked, stop through did not\n\nGold last night not great, but didnt' lose a ton\n\nLOST BY NOT BEING IN OR. NEED TO BE IN 10. TAKe HALF OFF AT 5 yolo 5\n\n\nSo i fucked up gold. need to not market make. it's not the easy button. i need to wait, it was buying today. i need to ignore odd lot prints, that didn't matter as much. go with, hold. wait for 30s time delta", "2025-06-11": "Crude news. not great. crude settle had a seller after a massive up day. went, but not enough\n\nES. actually pretty decent here. OR highs didn't work because i was in 1 tick early. need to have 1 tick behind. wasn't super confident though\nES lows though, pretty sweet. worked for 7ish, then took a small loser on the rest\n\nWhat murdered me though was i had originally entered trades in MES, i thought i clicked a to cancel. But they were in the book............... lost 700 on that\n\nGold fucking SUCKED during the day. nothing good in there my guy. too risky, can't be in mgc. need to work on execution for night trade and thats it\n\nmnq wtf did i do here?\n\nng: exhausting. showed up at 7 am, leane donit, stop through, came back in, second berg was good. got a massive winner, then i thin ki lost on the bid berg for it's out\n\nthen i just got chopped up. it was my only winning market of the day, but i lost due to fees", "2025-06-18": "kinda fucked up gold. wait for stops to go off and place AVWAP. also stops more than 250 or w/e. then wait for cross and get in.\n\nES actually did ok. pre powell dump, got a little, then avwap from the start of the speech and stop on that for entry for the quick reversals. that worked and i think that should work going forward.\n\nDied in crude. Trump initially said \"iran should have taken the deal\" markets popped. I ACTUALLY WAITED FOR BASELINE FOR ENTRY. Then got in. THEN TRUMP SAID THE IRANIANS ARE INVITED TO THE FUCKING WHITE HOUSE. instant 50 tick loser. my fault i guess. when trump is talking, i go walking. fuck trump and his shitty wishy washy way of talking", "2025-06-22": "trump bombed iran over weekend. hit nuclear bunkers. i initially panicked, but it was a nothing burger. no real response. CL, NG gap up, no good at all. ES gap down, no good either. Gold the only good one. maybe do gold next time. lots of stops. ADD A STOP TO YOUR OPEN TRADE. IT SAVED YOU TODAY", "2025-06-23": "HURRAH THE WAR IS OVER. just like that, ceasefire. news threw me for a loop today. i traded es and died. i thought it was going to be a btfd and boy was it. it was so violent and so quick i was frazzled. tried to get short on breaks in es, that was a mistake. perhaps i shouldn't even have a bias? maybe i see news story and go with trend? or perhaps i stay out entirely and just trades stops and gold with lower stress... that sounds kinda nice\n\nOR kinda worked on the downside, had to hodl a bit though. the upside idk what happened. i think i might have missed actually? i'm not sure. i had to delete my stop due to the craziness of the news.", "2025-06-24": "ng had some weird shit in july. like 76's buying and 110's buying. very weird. got the post settle fade on a weird move. tried going with on the sell, but it didn't work.\n\nPost settle fade was good with avwap\n\nES. OR didn't work great, but i basically scratched, which i will gladly take\n\nSome euro news about them putting on retaliatory tariffs on US was ok for a move, but not great\n\n250 stupid, just gotta stay away\n\nhad an idea it was up a bunch i could get in on avwap for a break at 52, also bad.\n\nSo here was the interesting one. MOC came out very close to 0. basically buy side, then it ticked to like almost -1b before 59?\n\nso i got pre short with a stop above. seemed to work ok, but 48 really turned around. the market the proceeded to go down, but was it good? idk\n\n", "2025-06-25": "OR did not work today. tight range, but i didn't lose a lot\n\nes a bit tougher. moo was slightly red, dipped at open then went up. tried to do fade, but it wasn't great.\n\nNG had some 200 lot bergs during the day. didn't do well. what was good was settle. decently directional, used stops to get in. held pretty much the whole time. got out near end of settle. then when avwap broke, got long. then big bergs came in on the offer, i got out and got short. that worked through lows again. then at lows, still a big move to retrace. got in when it seemed kinda done and doubled down on avwap area. didn't really go, but held for like 10-20 minutes. just didn't feel like it was gonna work. so i put my stop on a berg and got out.\n\nES MOC was 1.4 bil to sell side and it went up. then it ticked up to like 2.1 billion to sell at 58. i was looking for sell side bias. there were executions coming in on the bid, but it was chop and not good or clear.", "2025-06-26": "https://ir.eia.gov/ngs/ngs.html\n\nthis is the eia release,\n\nng was interesting. it had a 9 bil miss. swiped down, then came back to base within 15 seconds without breaking. great go with. then after base worked, it broke lows. then more offers came in that were bergs. big bergs like 400 and 300. then they traded through. then after that, there was a further move down. maybe a puke. after that one more big offer berg dragged and puked. like 450. after that, there as a d3 berg that showed(d3 was the size henry was using, so v reasonable to be a 500 lot berg which it was earlier today). that was the low. keep in mind what a large move is, players you remember, and reacting to when a moves go to far and enter on players that you know to go in the direction of a fade.\n\n\n\nNQ/ES today. fantastic. gotta be ready for it. got my shit for it now\n\nstay away from es. what's good? idk\n\nso moc was like -2.6 billion today. kinda nutty close. didn't see too much. but there was an offer that came in probably 59:40. came in 3 times. then popped up after it was done. then i got the fade of the fade with a 2 lot. that's what really set it off\n\n", "2025-06-27": "crude news OPEC massive output increase. got short crude, didn't hold... should have let it cook more\n\nOR in es, short got hit. i guess i have to be in 1 tick below. i got hurt. i also didn't let it cook and took a small loser instead of a winner...\n\nrty, got in for a spot where i thought i saw buying, it wasn't clear and i lost. rty recon today. but looked back at previous and it's almost always a dud\n\nng leaned on a berg, traded through, no other trades. gold tried fading after stops, no good. need to look for bergs.\n\noverall, i need to hold OR and some news. i did actually win for some canada news where trump said trade negotiaitions with canada are over.... that worked, but lost everywhere else", "2025-06-30": "EoQ today. silver had a large offer come in. 51-57. was really good. just ripped. fade was super slow but did work post gold a little\n\nGold was great. just ripped down. got in with a stop. i couldn't tell exactly what it was. fade was ok\n\nES or actually worked at highs. also 50's came in early in es at the open. just before the bell. sold two and held. very happy with that\n\ngot short post OR with the 500 and potential avwap break. didn't work. should have held OR\n\nub just didn't have a clear signal. es had a size come in right before 59. that was the signal. that was good.\n\nwith a limited attention, how do i decide what to look at? do i just see the first thing with a signal and stare?\n\ni lost sooo much in UB being in my max... really depressing\n\n", "2025-07-01": "NQ size zaps seem good\n\nrandom k trade in rty. it was up while nq and es were down. k was like it's a good fade. i got in after 9's buying. was decent. also trump news where he said powell is bad or something along those lines helped\n\nboth ORs failed today...\n\nturmp news no trade deal with japan. was good. dumbass\n\nmoc interesting today started out 1.5 bil, then ticked to like 600 mil, then was like -500 mil at one point. maybe look into that for 55 sweep? seems to be reacting to updates and today seemed a bit late?\n", "2025-07-02": "didn't trade much today. coded a lot. got a ton done with charts. gonna pivot to notes next", "2025-07-03": "50's in es at the open. sized up. didn't work\n\nng tried trading EIA. don't do avwap break, just look for a buddy. about 6 bil miss, so i was looking to fade\n\ngold tried fading 50's. they showed up right before 8 o clcok i think. COULD BE WORTH A  PULL", "2025-07-07": "Day started out with pepper in crude. came in around 8am. was really really good. lik e67 ticks. idk how to hold though, it was in there for like 2 hours\n\nsome weird shit happened during settle at like 27. just launched. maybe put stops there tomorrow. big range today\n\nMISSED ES 500 lot at OPEN. WAS GOOD> SHIT\n\nES NEWS. trade deal news with korea and japan. they are getting tariffs aug 1. market didnt' like that. gave a bit too much back\n\n25's came in the book around other tariff news. malaysia or something. there was a large berg 1 tick in front that really bounced. the trade through of the berg price wasn't good. i took a loser because people had their stops one tick below. very annoying. that trade through was great though and lots of trade throughs were good\n\nMOC was 2.3 bil to buy, drawing avwap on that and playing the bounces would have worked. also post 3 was a good breakout. by the end of the day, it went from 2.3 bil to buy to basically 0. very weird\n\n\n\n", "2025-07-09": "Pepper at 8am was good today. really went. size up and hold longer\n\nor on the way down was pretty good. went in a really weird way. change your oco's. i think you missed stuff on a wick", "2025-07-10": "Pepper in crude was great. felt very lucky. just tanked when it came in on the offer.\n\nng had the number, baseline didn't work. some bergs i think but they weren't good\n\nes. i fucked up OR on the upside. i got a good entry, but it just went up, then came back and tested. i gotta be willing to take a 10 tick loser on that...\n\n50's in es on offer. i leaned on them, but that didn't work lost small. the better play was the stop through, although i think i should have done both\n\nbaseline at 250 on a -2 bil moc miss seemed good. maybe worth a backtest \n\nworked a 2 lot at 59 and 5930. 59 no trade, 5930 scratch", "2025-07-14": "cl pepper today was pretty good. actually just worked the whole rest of the day. move at 8 am pre threw me off, but it was good\n\ncl move as well for news. i hopped on it. it worked.\n\nes OR bad\n\nes stops at 59 no trade 5930 hit, but wasn't good. then 50 seemed decent. idk is it worth it?", "2025-07-17": "pepper nq in the morning. not great. well it worked initally, then chopped. \n\nfade no bueno\n\ngrowing bid in es. was pretty good, but choppy. got huge like 2.2k", "2025-07-18": "copper pepper was good. gotta be there 732. \n\nnq pepper 830 really tough so far... i wish i could size down\n\nes MOC was 1.6 bil to buy. i got long at baseline and held. that worked", "2025-07-22": "1k in nq.\n\n750 es and 250 nq\n\npepper in nq on bid at 830, appeared to work, but risky. keep watching\n\nSOL cal blew up", "2025-07-23": "ES had 1 500, then 2 250's in nq. also some 500's before that didn't have an NQ\n\nthis happened pre equity settle and randomly throughout the day. need to be aware of that. also time delta of like 13 mins, so be aware?\n\nES\n13:44:30.995240\t6392.25\t750\t8\n13:38:04.784414\t6391.75\t750\t9\n13:25:04.008519\t6393.25\t750\t9\n13:14:38.322048\t6389.75\t500\t6\n13:06:49.981968\t6386.5\t500\t5\n13:05:58.775623\t6386.00\t500\t4\n\nNQ \n14:56:07.757601\t23310.00\t250\t30\n13:44:38.050220\t23302.75\t250\t11\n13:38:07.841880\t23302.50\t250\t14\n13:25:06.814893\t23319.75\t250\t22\n13:22:22.573676\t23304.75\t250\t25\n13:14:55.690991\t23295.25\t250\t40\n13:14:48.138966\t23288.75\t207\t25", "2025-07-24": "Growing offer at 59 in es. was good. fade on the size clusters seems good. lots of sizes down there....\n\ngold faded settle. i think it's a good candidate for the stop trade\n\ncl pepper fake out in the mroning. then crude news. venezula can pump oil through chevron. was good\n\nnq trade. dont' trade pepper or it period....", "2025-07-25": "ES OR on bid worked. my trailers got popped. i think they need more rope. like 15 ticks. also my oco's didn't appear to hit? i feel like they should have?\nCL pepper was good \n\nES miss click worked\n\nNG had a sharp move down at the beginning of settle, then went no where from there. luckily, i had stops", "2025-07-28": "Gold random move down with stops. got short on avwap with some offer bergs\n\nCL some newsy move about trump and putin fighting. i got long, it worked\n\nHG chile tariff exemption news. i hopped on it. 3 200 lot offers came in they weren't good\n\nnq sizes today. 400 and 700. i got short when they pulled on offer in anticipation of them coming back in and it just worked\n\nng FND -1 today. 8's buying in aug, but didn't work. price moved down and the fade worked? idk man\n\nrty 118 lot coming to market on the bid starting at 5730. went 10 ticks total.....................................\n\nES OR low worked today\n\nstupid ", "2025-07-29": "Tried fading a discrepancy in rty from es and nq like the old days. didn't work at 830\n\nOR worked in es, but needed to yolo a bit more on the last one\n\ngot long in es after OR super worked. just happened to catch the low and held\n\n\n", "2025-07-31": "CR213143894 Ticket for comcast\nTicket 2: CR213171282", "2025-08-04": "I was dumb today... did an early OR, didn't work. another OR didn't work. got chopped up in equity settle. saw 368 buyer and it was bad", "2025-08-06": "Some big blow up in ZB today at 1036. wasn't there, didn't see it. i guess it was bergs\n\nES 59 TB got me short, but nothing came in so i got out", "2025-08-07": "Gotta be careful with OR, only 30 -60 line ups...\n\nused timebreak in es at 59, it worked. nothing clear though. one day before non farm\n\ngold blow up on waller as potential fed chair. nothing else moved. fade worked, baseline didn't ", "2025-08-08": "Crude News today. did poorly. wasnt at desk. if not immediately at desk, just avoid\n\npepper in crude i lost on, but i think i needed to risk 10?\n\ngold blow up. something about tariffs and then reversal\n\n\nno es OR today\n\ntough chaotic week. shake it off and be back monday", "2025-08-11": "gold pepper no bueno today. also might not ahve been real?\n\nGold breakout on a 400 lot offer berg. felt like i was late, and got a good fill\n\nhogs 15m OR with big 300 lot berg offer on it. thought the breakout would be good, was not, but not a horrtible trade i don't think\n\nES 30/60 OR not great. it went like 12 maybe, but i held too many. gotta take off more and have a small yolo\n\nfade at 3 worked today. big MOC of around -2 bil. market went down, actually went down today lol\n\nwent up the last 5 minutes. i think the day was right and the end of the day was just profit taking, so i worked off market for a short\nand got a nice sweep fill. kinda weird i feel that that happens often? idk keep thinking\n\ncrude 8 am was a good trade. i think it's time to automate it. went like a free 10 today\n\n\n", "2025-08-12": "lost in es settle doing stupid shit. big up day on cpi, thought people were going to profit take. maybe they only do that on down days?\n\nit's up massively today. almost new ATH\n\ngold, dud, no pep\n\nhogs? don't know what i did, but small loser\n\ncpi NQ 1k lot. white bar, then traded through no bounce\n\ncrude 8 am didn't work\n\nES OR slipped, missed by 1 tick. did go 12 ticks total though\n", "2025-08-14": "Time break for gold 1229 would have worked today. experiment with it tomorrow\n\nand i died during equity settle fading.... i think i need to stop trading equity settle... completely............", "2025-08-18": "ES OR low was the only one that existed. faded the or high that wasn't 30/60 and that worked\n\nthere was as dragging bid that came in for the break, then it puked.\n\ndragging offer.\n\nbig berg today randomly in es too. was like a 100. traded to 2.1k then pulled on the 4th bounce\n\ntook a loser on OR low 30/60. went like 8 ticks. i think i have to trail if it goes 8? like move it up to scratch?", "2025-08-20": "crude time break 8 am. initially didn't work, took some heat of 5 ticks and puked. maybe i need a 7 tick stop? it did end up working\n\nsome news about trump wanting to fire fed cook came out. i kinda got short small, but it was a stale headline. i got out\n\nes 2:58:59 time break didn't work. i guess it should really just go huh?", "2025-08-21": "Another 30/60 line up es OR fail.... i think i'm done?\n\n8 am crude worked. that's the only thing working... i think i'll do just that tomorrow\n\nno fills at silver or gold today\n\n5930 just launched in es.\n\nsol cal blew up at 59. need crypto\n\n", "2025-08-22": "cl time break at 8 worked, but i had to take outs. worked at settle too\n\nonly winning trades..\n\ngold just a lot of chop. if i have an idea for an algo, just do the algo. dont' do stupid shit. you aren't fast, you can't do it\n\nes 59 no bueno today. something sold at 59 and got me short, but didn't continue? maybe i was too close\n\nzl blow up today. wasn't good though. something about bio fuel contract with epa?\n\n", "2025-08-25": "i reduced the amount that i traded for sure, but i need to pull back harder. really gotta be aware of news, but also aware that it's not gonna be good if trump is talking.", "2025-08-26": "Overall, did very well trading calmly (also intentionally not trading). Need to pay attention to orders coming in early. maybe the 51-54 time is good? 59 onwards seems crazy.... CL also didn't work amazingly, but i'm not losing a bunch. ", "2025-08-27": "281's selling every 3 in ES. it went about 15 ticks reasonably. i didn't touch it though...\n\nDid stupid shit in nvidia earnings. the one trade was leaning on bid bergs for the fade. don't try initial reaction shit with this, it's so hard to even understand what is going on", "2025-08-28": "i didn't lose a lot, which is good i guess. ng was the best trade of the day. cl timebreak at 8 could be better. i missed ng time break... need to add that", "2025-08-29": "NG time break would have worked at energy settle, cl would have lost. \n\nPL had a big order come in at 120304, it pulled 1 minute at the end of settle........... that seems like a great trade"}